{
    "format": "layers-model",
    "generatedBy": "keras v2.5.0",
    "convertedBy": "TensorFlow.js Converter v3.7.0",
    "modelTopology": {
        "keras_version": "2.5.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                224,
                                224,
                                3
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "conv2d_input"
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d",
                            "trainable": true,
                            "batch_input_shape": [
                                null,
                                224,
                                224,
                                3
                            ],
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                5,
                                5
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 2.0,
                                    "mode": "fan_in",
                                    "distribution": "truncated_normal",
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_1",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                5,
                                5
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 2.0,
                                    "mode": "fan_in",
                                    "distribution": "truncated_normal",
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d",
                            "trainable": true,
                            "dtype": "float32",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.25,
                            "noise_shape": null,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_v1",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_2",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 128,
                            "kernel_size": [
                                5,
                                5
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 2.0,
                                    "mode": "fan_in",
                                    "distribution": "truncated_normal",
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_3",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 128,
                            "kernel_size": [
                                5,
                                5
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 2.0,
                                    "mode": "fan_in",
                                    "distribution": "truncated_normal",
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "GlobalAveragePooling2D",
                        "config": {
                            "name": "global_average_pooling2d",
                            "trainable": true,
                            "dtype": "float32",
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_1",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.25,
                            "noise_shape": null,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_v1_1",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                1
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 64,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "VarianceScaling",
                                "config": {
                                    "scale": 2.0,
                                    "mode": "fan_in",
                                    "distribution": "truncated_normal",
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_v1_2",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                1
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_1",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 5,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ]
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "batch_normalization_v1/gamma",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_v1/beta",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_v1/moving_mean",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_v1/moving_variance",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_v1_1/gamma",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_v1_1/beta",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_v1_1/moving_mean",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_v1_1/moving_variance",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_v1_2/gamma",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_v1_2/beta",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_v1_2/moving_mean",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_v1_2/moving_variance",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d/kernel",
                    "shape": [
                        5,
                        5,
                        3,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_1/kernel",
                    "shape": [
                        5,
                        5,
                        64,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_1/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_2/kernel",
                    "shape": [
                        5,
                        5,
                        64,
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_2/bias",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_3/kernel",
                    "shape": [
                        5,
                        5,
                        128,
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_3/bias",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense/kernel",
                    "shape": [
                        128,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_1/kernel",
                    "shape": [
                        64,
                        5
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_1/bias",
                    "shape": [
                        5
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}